app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "ah"], ["created_at", "2017-11-16 06:18:49.637678"], ["updated_at", "2017-11-16 06:18:49.637678"]]
UPDATE "posts" SET "user_id" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["user_id", 10], ["updated_at", "2017-11-16 06:19:28.127371"], ["id", 3]]
---
  def create
    post = Post.create post_params
    @current_user.posts << post

    if post.save