app/controllers/session_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "bourkison"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "h"], ["LIMIT", 1]]
---
  def create
    # First find user with username, and if nil, find with email.
    user = User.find_by :username => params[:username]
    if user.blank?
      user = User.find_by :email => params[:username]